### Import dependencies

In [50]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame and explore data

In [41]:
csv_file1 = "Barcelona1992.csv"
df1 = pd.read_csv(csv_file1)
df1.head()

,url,Column 1,Pas 1,Pas 1_alt,Pas 2,Pas 2_link,Pas 3,Col 1,Col 2,Col 3,Total
0,https://es.wikipedia.org/wiki/Anexo:Medallero_...,1,https://upload.wikimedia.org/wikipedia/commons...,Equipo Unificado,Equipo Unificado,https://es.wikipedia.org/wiki/Equipo_Unificado...,(EUN),45,38,29,112
1,https://es.wikipedia.org/wiki/Anexo:Medallero_...,2,https://upload.wikimedia.org/wikipedia/commons...,Estados Unidos,Estados Unidos,https://es.wikipedia.org/wiki/Estados_Unidos_e...,(USA),37,34,37,108
2,https://es.wikipedia.org/wiki/Anexo:Medallero_...,3,https://upload.wikimedia.org/wikipedia/commons...,Alemania,Alemania,https://es.wikipedia.org/wiki/Alemania_en_los_...,(GER),33,21,28,82
3,https://es.wikipedia.org/wiki/Anexo:Medallero_...,4,https://upload.wikimedia.org/wikipedia/commons...,China,China,https://es.wikipedia.org/wiki/China_en_los_Jue...,(CHN),16,22,16,54
4,https://es.wikipedia.org/wiki/Anexo:Medallero_...,5,https://upload.wikimedia.org/wikipedia/commons...,Cuba,Cuba,https://es.wikipedia.org/wiki/Cuba_en_los_Jueg...,(CUB),14,6,11,31

### Create new data with select columns and rename columns

In [51]:
csv_file1 = "Barcelona1992.csv"
df1 = pd.read_csv(csv_file1)
df1 = df1[['Pas 2','Pas 3','Col 1','Col 2', 'Col 3', 'Total']].copy()
df1 = df1.rename(columns={'Pas 2':'country', 'Pas 3':'country_id','Col 1':'gold','Col 2':'silver','Col 3':'bronze','Total':'total'})
csv_file2 = "Atlanta1996.csv"
df2 = pd.read_csv(csv_file2)
df2 = df2[['Pas 2','Pas 3','Col 1','Col 2', 'Col 3', 'Total']].copy()
df2 = df2.rename(columns={'Pas 2':'country', 'Pas 3':'country_id','Col 1':'gold','Col 2':'silver','Col 3':'bronze','Total':'total'})
csv_file3 = "Sidney2000.csv"
df3 = pd.read_csv(csv_file3)
df3 = df3[['Pas 2','Pas 3','Col 1','Col 2', 'Col 3', 'Total']].copy()
df3 = df3.rename(columns={'Pas 2':'country', 'Pas 3':'country_id','Col 1':'gold','Col 2':'silver','Col 3':'bronze','Total':'total'})
csv_file4 = "Atenas2004.csv"
df4 = pd.read_csv(csv_file4)
df4 = df4[['Pas 2','Pas 3','Col 1','Col 2', 'Col 3', 'Total']].copy()
df4 = df4.rename(columns={'Pas 2':'country', 'Pas 3':'country_id','Col 1':'gold','Col 2':'silver','Col 3':'bronze','Total':'total'})
csv_file5 = "Pekin2008.csv"
df5 = pd.read_csv(csv_file5)
df5 = df5[['Pas 2','Pas 3','Col 1','Col 2', 'Col 3', 'Total']].copy()
df5 = df5.rename(columns={'Pas 2':'country', 'Pas 3':'country_id','Col 1':'gold','Col 2':'silver','Col 3':'bronze','Total':'total'})
csv_file6 = "Londres2012.csv"
df6 = pd.read_csv(csv_file6)
df6 = df6[['Pas 2','Pas 3','Col 1','Col 2', 'Col 3', 'Total']].copy()
df6 = df6.rename(columns={'Pas 2':'country', 'Pas 3':'country_id','Col 1':'gold','Col 2':'silver','Col 3':'bronze','Total':'total'})
csv_file7 = "Rio2016.csv"
df7 = pd.read_csv(csv_file7)
df7 = df7[['Pas 2','Pas 3','Col 1','Col 2', 'Col 3', 'Total']].copy()
df7 = df7.rename(columns={'Pas 2':'country', 'Pas 3':'country_id','Col 1':'gold','Col 2':'silver','Col 3':'bronze','Total':'total'})

In [52]:
df1.head()

            country country_id  gold  silver  bronze  total
0  Equipo Unificado      (EUN)    45      38      29    112
1    Estados Unidos      (USA)    37      34      37    108
2          Alemania      (GER)    33      21      28     82
3             China      (CHN)    16      22      16     54
4              Cuba      (CUB)    14       6      11     31

### Connect to local data base in postgres

In [53]:
rds_connection_string = "postgres:postgres@localhost:5432/OlympicGames_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [54]:
engine.table_names()

['barcelona_1992',
 'atlanta_1996',
 'sidney_2000',
 'atenas_2004',
 'pekin_2008',
 'londres_2012',
 'rio_2016']

### Use pandas to load csv converted DataFrame into database

In [55]:
df1.to_sql(name='barcelona_1992', con=engine, if_exists='append', index=False)

In [56]:
pd.read_sql_query('select * from barcelona_1992', con=engine).head()

            country country_id  gold  silver  bronze  total
0  Equipo Unificado      (EUN)    45      38      29    112
1    Estados Unidos      (USA)    37      34      37    108
2          Alemania      (GER)    33      21      28     82
3             China      (CHN)    16      22      16     54
4              Cuba      (CUB)    14       6      11     31

In [57]:
df2.to_sql(name='atlanta_1996', con=engine, if_exists='append', index=False)
df3.to_sql(name='sidney_2000', con=engine, if_exists='append', index=False)
df4.to_sql(name='atenas_2004', con=engine, if_exists='append', index=False)
df5.to_sql(name='pekin_2008', con=engine, if_exists='append', index=False)
df6.to_sql(name='londres_2012', con=engine, if_exists='append', index=False)
df7.to_sql(name='rio_2016', con=engine, if_exists='append', index=False)